In [2]:
import pandas as pd

In [3]:
df7=pd.DataFrame(
    {
        'emp_no':[1,2,3,4,5,6,7,8],
        'emp_name':['ravi','kiran','srilu','sanjana','neha','bhavana','basu','subbu'],
        'job':['Developer','Tester','DevOps','Frontend','Backend','Fullstack','Tester','Tester'],
        'salary':[1200,999,1000,899,999,99,800,890]
    }
    
)
df7

   emp_no emp_name        job  salary
0       1     ravi  Developer    1200
1       2    kiran     Tester     999
2       3    srilu     DevOps    1000
3       4  sanjana   Frontend     899
4       5     neha    Backend     999
5       6  bhavana  Fullstack      99
6       7     basu     Tester     800
7       8    subbu     Tester     890

In [4]:
df7['salary'].sum()

6886

In [5]:
df7['salary'].min()

99

In [6]:
df7['salary'].max()

1200

In [7]:
df7['salary'].std()

329.28049267629393

In [8]:
df7['salary'].mean()

860.75

In [9]:
df7['salary'].describe()

count       8.000000
mean      860.750000
std       329.280493
min        99.000000
25%       867.500000
50%       949.000000
75%       999.250000
max      1200.000000
Name: salary, dtype: float64

In [10]:
df7['salary'].cumsum()

0    1200
1    2199
2    3199
3    4098
4    5097
5    5196
6    5996
7    6886
Name: salary, dtype: int64